package bootstrap

import (
	"fmt"
)

// InitApp 初始化程序打印版本号
func InitApp() {
	appVersion := "3.14.5"
	git := "https://www.baidu.com/"
	//fmt.Printf("\u001B[;32m"+"====================================================")
	fmt.Printf("\u001B[;32m"+` 
	 _      _         _   _____                
	| |    |_|       | | |_   _|               
	| |     _  _ __  | | __| | _ __  ___   ___ 
	| |    | || '_ \ | |/ /| || '__|/ _ \ / _ \
	| |____| || | | ||   < | || |  |  __/|  __/
	\_____/|_||_| |_||_|\_\\_/|_|   \___| \___|`+"\n\n\t"+
		`Version:`+"%v   Github:%v"+"\u001B[0m\n", appVersion, git)
	fmt.Printf("\u001B[;32m" + "====================================================\u001B[0m\n\n")
}
